import sampleImage from './chin_up.jpeg';
export const STEPS_DATA = {
  data: {
    Step: [
      {
        id: 0,
        name: '인버티드 로우',
        subTitle: '가슴 높이',
        rep: 8,
        rest: 2,
        set: 3,
        imageUrl: sampleImage,
        detail:
          '1. 어깨 넓이의 1.5배로 봉을 잡아서 다리를 쭉 피거나 직각으로 만들어줍니다.\n(개인적으로 직각을 만들어 다리힘도 함께 사용하시면 더욱 수월한 운동이 가능합니다.)\n2. 직각으로 다리를 만들고 운동을 한다는 가정하에 팔을 당기며 명치를 바에 가져다 대줍니다.\n3. 다리도 함께 쭉 펴주며 팔로 당기는 힘을 보조해줍니다.\n4. 다시 천천히 등의 자극을 느끼며 1번 자세로 돌아와줍니다.',
        status: 'complete',
      },
      {
        id: 1,
        name: '인버티드 로우',
        subTitle: '바닥과 평행',
        rep: 8,
        rest: 2,
        set: 3,
        imageUrl: sampleImage,
        detail:
          '1. 어깨 넓이의 1.5배로 봉을 잡아서 다리를 쭉 피거나 직각으로 만들어줍니다.\n(개인적으로 직각을 만들어 다리힘도 함께 사용하시면 더욱 수월한 운동이 가능합니다.)\n2. 직각으로 다리를 만들고 운동을 한다는 가정하에 팔을 당기며 명치를 바에 가져다 대줍니다.\n3. 다리도 함께 쭉 펴주며 팔로 당기는 힘을 보조해줍니다.\n4. 다시 천천히 등의 자극을 느끼며 1번 자세로 돌아와줍니다.',
        status: 'lock',
      },
      {
        id: 2,
        name: '풀업 밴드',
        subTitle: '초록색',
        rep: 8,
        rest: 2,
        set: 3,
        imageUrl: sampleImage,
        detail:
          '1. 어깨 넓이의 1.5배로 봉을 잡아서 다리를 쭉 피거나 직각으로 만들어줍니다.\n(개인적으로 직각을 만들어 다리힘도 함께 사용하시면 더욱 수월한 운동이 가능합니다.)\n2. 직각으로 다리를 만들고 운동을 한다는 가정하에 팔을 당기며 명치를 바에 가져다 대줍니다.\n3. 다리도 함께 쭉 펴주며 팔로 당기는 힘을 보조해줍니다.\n4. 다시 천천히 등의 자극을 느끼며 1번 자세로 돌아와줍니다.',
        status: 'lock',
      },
      {
        id: 3,
        name: '풀업 밴드',
        subTitle: '보라색',
        rep: 8,
        rest: 2,
        set: 3,
        imageUrl: sampleImage,
        detail:
          '1. 어깨 넓이의 1.5배로 봉을 잡아서 다리를 쭉 피거나 직각으로 만들어줍니다.\n(개인적으로 직각을 만들어 다리힘도 함께 사용하시면 더욱 수월한 운동이 가능합니다.)\n2. 직각으로 다리를 만들고 운동을 한다는 가정하에 팔을 당기며 명치를 바에 가져다 대줍니다.\n3. 다리도 함께 쭉 펴주며 팔로 당기는 힘을 보조해줍니다.\n4. 다시 천천히 등의 자극을 느끼며 1번 자세로 돌아와줍니다.',
        status: 'enabled',
      },
      {
        id: 4,
        name: '벤치 턱걸이',
        rep: 8,
        rest: 2,
        set: 3,
        imageUrl: sampleImage,
        detail:
          '1. 어깨 넓이의 1.5배로 봉을 잡아서 다리를 쭉 피거나 직각으로 만들어줍니다.\n(개인적으로 직각을 만들어 다리힘도 함께 사용하시면 더욱 수월한 운동이 가능합니다.)\n2. 직각으로 다리를 만들고 운동을 한다는 가정하에 팔을 당기며 명치를 바에 가져다 대줍니다.\n3. 다리도 함께 쭉 펴주며 팔로 당기는 힘을 보조해줍니다.\n4. 다시 천천히 등의 자극을 느끼며 1번 자세로 돌아와줍니다.',
        status: 'enabled',
      },
      {
        id: 5,
        name: '점프 턱걸이',
        rep: 8,
        rest: 2,
        set: 3,
        imageUrl: sampleImage,
        detail:
          '1. 어깨 넓이의 1.5배로 봉을 잡아서 다리를 쭉 피거나 직각으로 만들어줍니다.\n(개인적으로 직각을 만들어 다리힘도 함께 사용하시면 더욱 수월한 운동이 가능합니다.)\n2. 직각으로 다리를 만들고 운동을 한다는 가정하에 팔을 당기며 명치를 바에 가져다 대줍니다.\n3. 다리도 함께 쭉 펴주며 팔로 당기는 힘을 보조해줍니다.\n4. 다시 천천히 등의 자극을 느끼며 1번 자세로 돌아와줍니다.',
        status: 'enabled',
      },
    ],
  },
};
